//Однострочный комментарий
/*  
Многострочный
комментарий
*/
//console.log("JS say hello!");
//Вывод информации в консоль
console.info("JS say hello!");
//Вывод информации в консоль
console.error("JS say hello!");
//Вывод информации в консоль в виде ошибки
console.warn("JS say hello!");
//Вывод инф. в консоль в виде предупреждения
var figure = 5;
//Создание и присвоение чего либо к переменной
figure = 7;
//Переопределение значения переменной
console.log("Переменная: " + figure + ".");
//+ =обьеденение строк
const num = 15;
//Та же переменная но без возможности переопределить
var word;
word = "Words";
var torf;
torf = true;
